import { Heading } from '@/components/ui'

import styles from './Razgon.module.scss'

export const RecRazgonScreen = () => {
	return (
		<div className={styles.container}>
			<Heading
				style={{ textAlign: 'center' }}
				title="Альтернативное использование выделяемой тепловой энергии"
			/>
			<p>
				Майнинг представляет собой энергоемкий процесс, выделяющий значительное
				количество тепла. Этот побочный продукт деятельности майнеров может быть
				использован с пользой.
			</p>
			<Heading
				style={{ textAlign: 'center' }}
				title="Сложность майнинга и потребляемая энергия"
			/>
			<p>
				Сложность вычислений для добычи новых блоков постоянно растет, что
				требует более мощного оборудования. Чем мощнее оборудование, тем оно
				ожидаемо потребляет больше электричества. Сегодня потребление энергии
				при майнинге составляет примерно 100 ТВтч в год. Этот процесс
				сопровождается интенсивной генерацией тепла.
			</p>
			<p>
				Изначально это тепло считалось побочным продуктом, однако со временем
				ему нашлось применение. Это сделало процесс более эффективным и
				экологически безопасным.
			</p>
			<Heading
				style={{ textAlign: 'center' }}
				title="Сколько тепла дает установка для майнинга"
			/>
			<p>
				Объем тепла, который выделяет установка для майнинга , может
				варьироваться и зависит от многих факторов, включая энергоэффективность
				оборудования, его производительность и объем потребляемой энергии.
				Стандартные установки обычно потребляют от 1 до 3 кВт электричества в
				час. При этом на расчеты идет около 5% потребляемой электроэнергии, а
				остальное уходит в виде тепла. Например, при потреблении 2,5 кВт в тепло
				уходит 2,4 кВт.
			</p>
			<p>
				Мощность майнеров и, соответственно, количество тепла от них можно
				регулировать с помощью прошивок. С 2,5 кВт можно понизить до 1 кВт или
				повысить до свыше 3 кВт. Соответственно изменится заработок и
				температура от оборудования. Обновленные прошивки дают больше информации
				о состоянии устройства, чем стандартные программы для работы с
				майнерами. Во избежание перегрева они подстраивают индивидуально частоту
				каждого чипа. Это позволяет существенно продлить срок службы устройств.
			</p>
			<Heading
				style={{ textAlign: 'center' }}
				title="Помощь в отоплении домов"
			/>
			<p>
				Наиболее очевидное использование тепла - это отопление. Многие майнеры
				используют тепло от майнинговых установок для обогрева домов или офисов,
				особенно в холодные зимние месяцы. Это уменьшает потребность в
				дополнительном источнике отопления и позволяет снизить общие
				энергетические затраты.
			</p>
			<Heading style={{ textAlign: 'center' }} title="Применение в виноделии" />
			<p>
				Процесс виноделия требует строгого контроля температуры на разных
				этапах, включая ферментацию и выдержку вина. Тепло, вырабатываемое
				майнинговыми установками, может быть использовано для поддержания
				оптимальных условий на этих этапах, особенно в холодные сезоны или в
				регионах с холодным климатом.
			</p>
			<p>
				Во время ферментации важно поддерживать стабильную температуру, обычно в
				диапазоне от 20 до 28 градусов Цельсия для красного вина и от 15 до 18
				градусов для белого вина. Тепло от майнинговых установок может быть
				эффективно использовано для поддержания этих температур, даже если
				окружающая температура снижается. Кроме того, некоторые виды вина
				требуют длительного периода выдержки при контролируемой температуре.
				Тепло от майнинга также может быть использовано для поддержания этой
				температуры в течение всего периода выдержки. Помимо этого,
				использование тепла от майнинга может помочь винодельческим предприятиям
				снизить затраты на энергию и улучшить свою устойчивость к изменениям
				климата. В то же время, они могут увеличить свою доходность от майнинга,
				так как тепло, которое ранее было просто побочным продуктом, теперь
				становится ценным ресурсом.
			</p>
			<Heading
				style={{ textAlign: 'center' }}
				title="Майнинг и сельское хозяйство"
			/>
			<p>
				Для обогрева теплиц идеально подходят майнеры на иммерсионном
				охлаждении. В отличие от ферм «на воздухе», эти установки не только
				нагревают воздух в помещении, но и позволяют, например, подогревать воду
				для капельного полива, гидропонных и аквапонных систем. При помощи
				настраиваемой автоматики можно обеспечить круглосуточное и стабильное
				поддержание необходимой для жизнедеятельности растений температуры.
				Излишки тепла сбрасываются в окружающую среду при помощи градирни. Среди
				преимуществ установок на иммерсионном охлаждении это, в частности, то,
				что они менее чувствительны к высокой влажности в теплице, что позволяет
				поддерживать благоприятный микроклимат для растений. К тому же
				диэлектрическая жидкость и иммерсионная установка в целом не выделяет
				никаких вредных для человека и растений веществ. Стойка на иммерсионном
				охлаждении занимает мало места, поскольку обладает вертикальной
				конструкцией и может устанавливаться на любой твёрдой площадке внутри
				теплицы. Также стоит отметить, что иммерсионные установки легко
				подбираются в зависимости от потребностей в выделяемой тепловой
				мощности.
			</p>
			<Heading style={{ textAlign: 'center' }} title="Вывод" />
			<p>
				Избыток тепла, выделяемый при добыче криптовалют, относительно несложно
				потратить с пользой, минимизировав вредное воздействие на экологию,
				сэкономив ресурсы и при этом заработав. Пока таких проектов немного и
				они носят главным образом экспериментальный характер, однако их
				количество стабильно растет.
			</p>
			<p>
				У сектора майнинга есть потенциал и все шансы стать важной частью
				энергетической системы. Утилизация тепла полностью вписывается в
				глобальный тренд достижения максимальной энергоэффективности.
			</p>
		</div>
	)
}
